mhaberler/canopennode/CANopen_stack/stm32f103x/co_driver.c
/*******************************************************************************

   File: CO_driver.c
   CAN module object for STM32F103
   
   Copyright (C) 2004-2010 	Janez Paternoster
   Copyright (C) 2012 Ondrej Netik

   License: GNU Lesser General Public License (LGPL).

   <http://canopennode.sourceforge.net>
*/
/*
   This program is free software: you can redistribute it and/or modify
   it under the terms of the GNU Lesser General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU Lesser General Public License for more details.

   You should have received a copy of the GNU Lesser General Public License
   along with this program.  If not, see <http://www.gnu.org/licenses/>.


   Author of CanOpenNode: 	Janez Paternoster
   Author of stm32f103x driver: Ondrej Netik

*******************************************************************************/


#include <string.h>     // for memcpy
#include <stdlib.h>     // for malloc, free
#include <stm32f10x_conf.h>
#include "CO_driver.h"
#include "CO_Emergency.h"


void InitCanLeds() {
    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_LED, ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_Led_GREEN | GPIO_Pin_Led_RED;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIO_LEDS, &GPIO_InitStructure);
    CanLedsOff(eCoLed_Green | eCoLed_Red);
}

void CanLedsSet(eCoLeds led) {
    if (led & eCoLed_Green)
        CanLedsOn(eCoLed_Green);
    else
        CanLedsOff(eCoLed_Green);

    if (led & eCoLed_Red)
        CanLedsOn(eCoLed_Red);
    else
        CanLedsOff(eCoLed_Red);


}

void CanLedsOn(eCoLeds led) {
    if (led & eCoLed_Green) {
#ifdef LED_POSITIVE
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#else
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#endif
    }
    if (led & eCoLed_Red) {
#ifdef LED_POSITIVE
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#else
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#endif
    }
}

void CanLedsOff(eCoLeds led) {
    if (led & eCoLed_Green) {
#ifdef LED_POSITIVE
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#else
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#endif
    }
    if (led & eCoLed_Red) {
#ifdef LED_POSITIVE
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#else
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#endif
    }
}

void memcpySwap2(UNSIGNED8* dest, UNSIGNED8* src) {
#ifdef __BIG_ENDIAN__
	*(dest++) = *(src + 1);
    *(dest) = *(src);
#else
    dest[0] = src[0];
    dest[1] = src[1];
#endif
}

void memcpySwap4(UNSIGNED8* dest, UNSIGNED8* src) {
#ifdef __BIG_ENDIAN__
    src += 3;
    *(dest++) = *(src--);
    *(dest++) = *(src--);
    *(dest++) = *(src--);
    *(dest) = *(src);
#else
    dest[0] = src[0];
    dest[1] = src[1];
    dest[2] = src[2];
    dest[3] = src[3];
#endif
}


/*******************************************************************************
   Macro and Constants - CAN module registers
 *******************************************************************************/
void CO_CANsetConfigurationMode(CO_CANmodule_t *can) {
//    unsigned int wait_ack = 0;

    /* Request initialisation */
//    can->CANbaseAddress->MCR |= CAN_MCR_INRQ;

    /* Wait the acknowledge */
//    while (((can->CANbaseAddress->MSR & CAN_MSR_INAK) != CAN_MSR_INAK) && (wait_ack != INAK_TIMEOUT))
//        wait_ack++;

    /* Check acknowledge */
//    if ((can->CANbaseAddress->MSR & CAN_MSR_INAK) != CAN_MSR_INAK) {
        // enter to configuration mode failed

//    }


}

/******************************************************************************/
void CO_CANsetNormalMode(CO_CANmodule_t *can) {
//    unsigned int wait_ack = 0;

    /* Request leave initialisation */
//    can->CANbaseAddress->MCR &= ~(uint32_t) CAN_MCR_INRQ;

    /* Wait the acknowledge */
//    while (((can->CANbaseAddress->MSR & CAN_MSR_INAK) == CAN_MSR_INAK) && (wait_ack != INAK_TIMEOUT))
//        wait_ack++;

    /* ...and check acknowledged */
//    if ((can->CANbaseAddress->MSR & CAN_MSR_INAK) == CAN_MSR_INAK) {
        // leave initialization state failed

//    }

}

/******************************************************************************/
INTEGER16 CO_CANmodule_init(
        CO_CANmodule_t **ppCANmodule,
        CAN_TypeDef *CANbaseAddress,
        UNSIGNED16 rxSize,
        UNSIGNED16 txSize,
        UNSIGNED16 CANbitRate) {
    CAN_InitTypeDef CAN_InitStruct;
    CAN_FilterInitTypeDef CAN_FilterInitStruct;
    GPIO_InitTypeDef GPIO_InitStructure;
    int i;
    if ((*ppCANmodule) == NULL) {
        if (((*ppCANmodule) = (CO_CANmodule_t *) malloc(sizeof (CO_CANmodule_t))) == NULL) {
            return CO_ERROR_OUT_OF_MEMORY;
        }
        if (((*ppCANmodule)->rxArray = (CO_CANrxArray_t *) malloc(rxSize * sizeof (CO_CANrxArray_t))) == NULL) {
            free(*ppCANmodule);
            *ppCANmodule = 0;
            return CO_ERROR_OUT_OF_MEMORY;
        }
        if (((*ppCANmodule)->txArray = (CO_CANtxArray_t *) malloc(txSize * sizeof (CO_CANtxArray_t))) == NULL) {
            free((*ppCANmodule)->rxArray);
            free(*ppCANmodule);
            *ppCANmodule = 0;
            return CO_ERROR_OUT_OF_MEMORY;
        }
    } else if ((*ppCANmodule)->rxArray == NULL || (*ppCANmodule)->txArray == NULL) return CO_ERROR_ILLEGAL_ARGUMENT;

    CO_CANmodule_t *CANmodule = *ppCANmodule; //pointer to (newly created) object

    CANmodule->CANbaseAddress = CANbaseAddress;
    CANmodule->rxSize = rxSize;
    CANmodule->txSize = txSize;
    CANmodule->curentSyncTimeIsInsideWindow = 0;
    CANmodule->bufferInhibitFlag = 0;
    CANmodule->transmittingAborted = 0;
    CANmodule->firstCANtxMessage = 1;
    CANmodule->CANtxCount = 0;
    CANmodule->errOld = 0;
    CANmodule->EM = 0;

    CO_CanInterrupt(CANmodule, DISABLE);

    for (i = 0; i < rxSize; i++) {
        CANmodule->rxArray[i].ident = 0;
        CANmodule->rxArray[i].pFunct = 0;
    }
    for (i = 0; i < txSize; i++) {
        CANmodule->txArray[i].bufferFull = 0;
    }

