mhaberler/canopennode/CANopen_stack/stm32f103x/co_driver.c
    /* Setting Clock of CAN HW */
    RCC_APB2PeriphClockCmd(CLOCK_GPIO_CAN | RCC_APB2Periph_AFIO, ENABLE);
    RCC_APB1PeriphClockCmd(CLOCK_CAN, ENABLE);
    /* Remap */
    GPIO_PinRemapConfig(GPIO_Remapping_CAN, GPIO_CAN_Remap_State);
    /* Configure CAN pin: RX */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_RX;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIO_CAN, &GPIO_InitStructure);
    /* Configure CAN pin: TX */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_TX;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIO_CAN, &GPIO_InitStructure);

    /* Init CAN controler */
    CAN_DeInit(CANmodule->CANbaseAddress);
    CAN_StructInit(&CAN_InitStruct);
    switch (CANbitRate) {
        case 1000: CAN_InitStruct.CAN_Prescaler = 6;
            break;
        case 500: CAN_InitStruct.CAN_Prescaler = 12;
            break;
        default:
        case 250: CAN_InitStruct.CAN_Prescaler = 24;
            break;
        case 125: CAN_InitStruct.CAN_Prescaler = 48;
            break;
        case 100: CAN_InitStruct.CAN_Prescaler = 60;
            break;
        case 50: CAN_InitStruct.CAN_Prescaler = 120;
            break;
        case 20: CAN_InitStruct.CAN_Prescaler = 300;
            break;
        case 10: CAN_InitStruct.CAN_Prescaler = 600;
            break;
    }
    CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_2tq;
    CAN_InitStruct.CAN_TTCM = DISABLE;  // Time Trigger
    CAN_InitStruct.CAN_ABOM = DISABLE;	// Automatic bus off management
    CAN_InitStruct.CAN_AWUM = DISABLE;	// Automatic Wakeup mode
    CAN_InitStruct.CAN_NART = ENABLE;	// No Automatic retransmision
    CAN_InitStruct.CAN_RFLM = DISABLE;	// Receive FIFO locked mode
    CAN_InitStruct.CAN_TXFP = DISABLE;	// Transmit FIFO priority 1=chronologically 0=by identifier

    TRACE_DEBUG("CAN_Init ");
    UNSIGNED8 result;
    if ((result = CAN_Init(CANmodule->CANbaseAddress, &CAN_InitStruct)) != CAN_InitStatus_Success) {
        TRACE_DEBUG_WP("res=%d\n\r", result);
        return result;
    }
    // nastavime 1 filtr, ktery prijima vse
    memset(&CAN_FilterInitStruct, 0, sizeof (CAN_FilterInitStruct));
    CAN_FilterInitStruct.CAN_FilterNumber = 0;
    CAN_FilterInitStruct.CAN_FilterIdHigh = 0;
    CAN_FilterInitStruct.CAN_FilterIdLow = 0;
    CAN_FilterInitStruct.CAN_FilterMaskIdHigh = 0;
    CAN_FilterInitStruct.CAN_FilterMaskIdLow = 0;
    CAN_FilterInitStruct.CAN_FilterFIFOAssignment = 0; // pouzivame jen FIFO0
    CAN_FilterInitStruct.CAN_FilterMode = CAN_FilterMode_IdMask;
    CAN_FilterInitStruct.CAN_FilterScale = CAN_FilterScale_32bit;
    CAN_FilterInitStruct.CAN_FilterActivation = ENABLE;
    CAN_FilterInit(&CAN_FilterInitStruct);

    // povoleni preruseni od CAN1
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    // preruseni od prijimace
    NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
    NVIC_Init(&NVIC_InitStructure);
    // preruseni od vysilace
    NVIC_InitStructure.NVIC_IRQChannel = USB_HP_CAN1_TX_IRQn;
    NVIC_Init(&NVIC_InitStructure);
    // preruseni od statusu
    //NVIC_InitStructure.NVIC_IRQChannel = CAN1_SCE_IRQn;
    //NVIC_Init(&NVIC_InitStructure);

    CAN_OperatingModeRequest(CANmodule->CANbaseAddress, CAN_OperatingMode_Normal);

    CO_CanInterrupt(CANmodule, ENABLE);
    TRACE_DEBUG_WP("Ok\n\r");

    return CO_ERROR_NO;
}

void CO_CanInterrupt(CO_CANmodule_t *CANmodule, UNSIGNED8 enb) {
    CAN_ITConfig(CANmodule->CANbaseAddress,
    		CAN_IT_TME | // Tx
            CAN_IT_FMP0  // Rx
            //CAN_IT_ERR |  // Error Interrupt
            //CAN_IT_BOF |  // BusOff interrupt
            //CAN_IT_EPV |  // Error Passive
            //CAN_IT_EWG    // Error Warning
            , enb);
}

/******************************************************************************/
void CO_CANmodule_delete(CO_CANmodule_t** ppCANmodule) {
    if (*ppCANmodule) {
        CAN_DeInit((*ppCANmodule)->CANbaseAddress);
        free((*ppCANmodule)->txArray);
        free((*ppCANmodule)->rxArray);
        free(*ppCANmodule);
        *ppCANmodule = 0;
    }
}

/******************************************************************************/
UNSIGNED16 CO_CANrxMsg_readIdent(CO_CANrxMsg_t *rxMsg) {
    return (rxMsg->ident >> 2) & 0x7FF;
}

/******************************************************************************/
INTEGER16 CO_CANrxBufferInit(CO_CANmodule_t *CANmodule,
        UNSIGNED16 index,
        UNSIGNED16 ident,
        UNSIGNED16 mask,
        UNSIGNED8 rtr,
        void *object,
        INTEGER16(*pFunct)(void *object, CO_CANrxMsg_t *message)) {
    CO_CANrxArray_t *rxBuffer;
    UNSIGNED16 RXF, RXM;

    //safety
    if (!CANmodule || !object || !pFunct || index >= CANmodule->rxSize) {
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

    //buffer, which will be configured
    rxBuffer = CANmodule->rxArray + index;

    //Configure object variables
    rxBuffer->object = object;
    rxBuffer->pFunct = pFunct;


    //CAN identifier and CAN mask, bit aligned with CAN module registers
    RXF = (ident & 0x07FF) << 2;
    if (rtr) RXF |= 0x02;
    RXM = (mask & 0x07FF) << 2;
    RXM |= 0x02;

    //configure filter and mask
    if (RXF != rxBuffer->ident || RXM != rxBuffer->mask) {
        rxBuffer->ident = RXF;
        rxBuffer->mask = RXM;
    }

    return CO_ERROR_NO;
}

/******************************************************************************/
CO_CANtxArray_t *CO_CANtxBufferInit(
        CO_CANmodule_t *CANmodule,
        UNSIGNED16 index,
        UNSIGNED16 ident,
        UNSIGNED8 rtr,
        UNSIGNED8 noOfBytes,
        UNSIGNED8 syncFlag) {
    //safety
    if (!CANmodule || CANmodule->txSize <= index) return 0;

    //get specific buffer
    CO_CANtxArray_t *buffer = &CANmodule->txArray[index];

    //CAN identifier, bit aligned with CAN module registers
    UNSIGNED32 TXF;
    TXF = ident << 21;
    TXF &= 0xFFE00000;
    if (rtr) TXF |= 0x02;

    //write to buffer
    buffer->ident = TXF;
    buffer->DLC = noOfBytes;
    buffer->bufferFull = 0;
    buffer->syncFlag = syncFlag ? 1 : 0;

    return buffer;
}

INTEGER8 getFreeTxBuff(CO_CANmodule_t *CANmodule) {
	UNSIGNED8 txBuff = 0;
	for (txBuff = 0; txBuff <= 3; txBuff++)
		//if (CAN_TransmitStatus(CANmodule->CANbaseAddress, txBuff) == CAN_TxStatus_Ok)
		switch (txBuff) {
		case (CAN_TXMAILBOX_0 ):
			if (CANmodule->CANbaseAddress->TSR & CAN_TSR_TME0 )
				return txBuff;
			else
				break;
		case (CAN_TXMAILBOX_1 ):
			if (CANmodule->CANbaseAddress->TSR & CAN_TSR_TME1 )
				return txBuff;
			else
				break;
		case (CAN_TXMAILBOX_2 ):
			if (CANmodule->CANbaseAddress->TSR & CAN_TSR_TME2 )
				return txBuff;
			else
				break;
		}
	return -1;
}
/******************************************************************************/
INTEGER16 CO_CANsend(CO_CANmodule_t *CANmodule, CO_CANtxArray_t *buffer) {
   //Code related to CO_CANclearPendingSyncPDOs() function:
   if(CANmodule->transmittingAborted){
    //if message was aborted on buffer, set interrupt flag
    //TODO:  if(CAN_REG(addr, C_TXBUF0 + C_TXCON) & 0x40){CANmodule->transmittingAborted--; CAN_REG(addr, C_INTF) |= 0x04;}
   }

   //Was previous message sent or it is still waiting?
   if(buffer->bufferFull){
      if(!CANmodule->firstCANtxMessage)//don't set error, if bootup message is still on buffers
         CO_errorReport((CO_emergencyReport_t*)CANmodule->EM, ERROR_CAN_TX_OVERFLOW, 0);
      return CO_ERROR_TX_OVERFLOW;
   }

   //messages with syncFlag set (synchronous PDOs) must be transmited inside preset time window
   if(CANmodule->curentSyncTimeIsInsideWindow && buffer->syncFlag && !(*CANmodule->curentSyncTimeIsInsideWindow)){
      CO_errorReport((CO_emergencyReport_t*)CANmodule->EM, ERROR_TPDO_OUTSIDE_WINDOW, 0);
      return CO_ERROR_TX_PDO_WINDOW;
   }

   //if CAN TB buffer0 is free, copy message to it
   INTEGER8 txBuff = getFreeTxBuff(CANmodule);
   if( (txBuff!=-1)  && CANmodule->CANtxCount == 0){
      CANmodule->bufferInhibitFlag = buffer->syncFlag;
      CO_CANsendToModule(CANmodule, buffer, txBuff);
   }
   //if no buffer is free, message will be sent by interrupt
   else{
      buffer->bufferFull = 1;
      CANmodule->CANtxCount++;
      // vsechny buffery jsou plny, musime povolit preruseni od vysilace, odvysilat az v preruseni
      CAN_ITConfig(CANmodule->CANbaseAddress, CAN_IT_TME, ENABLE);
   }

   return CO_ERROR_NO;
}
/******************************************************************************/
void CO_CANclearPendingSyncPDOs(CO_CANmodule_t *CANmodule) {
    DISABLE_INTERRUPTS();

