mhaberler/canopennode/CANopen_stack/stm32f103x/co_driver.c
    if (CANmodule->bufferInhibitFlag) {
        CANmodule->CANbaseAddress->TSR |= CAN_TSR_ABRQ0 | CAN_TSR_ABRQ1 | CAN_TSR_ABRQ2;
        ENABLE_INTERRUPTS();
        CO_errorReport((CO_emergencyReport_t*) CANmodule->EM, ERROR_TPDO_OUTSIDE_WINDOW, 0);
    } else
        ENABLE_INTERRUPTS();
}

/******************************************************************************/
void CO_CANverifyErrors(CO_CANmodule_t *CANmodule) {
   UNSIGNED32 err;
   CO_emergencyReport_t* EM = (CO_emergencyReport_t*)CANmodule->EM;

   err = CANmodule->CANbaseAddress->ESR;
   // if(CAN_REG(CANmodule->CANbaseAddress, C_INTF) & 4) err |= 0x80;

   if(CANmodule->errOld != err){
      CANmodule->errOld = err;

      //CAN RX bus overflow
      if(CANmodule->CANbaseAddress->RF0R & 0x08){
         CO_errorReport(EM, ERROR_CAN_RXB_OVERFLOW, err);
         CANmodule->CANbaseAddress->RF0R &=~0x08;//clear bits
      }

      //CAN TX bus off
      if(err & 0x04) CO_errorReport(EM, ERROR_CAN_TX_BUS_OFF, err);
      else           CO_errorReset(EM, ERROR_CAN_TX_BUS_OFF, err);

      //CAN TX or RX bus passive
      if(err & 0x02){
         if(!CANmodule->firstCANtxMessage) CO_errorReport(EM, ERROR_CAN_TX_BUS_PASSIVE, err);
      }
      else{
         INTEGER16 wasCleared;
         wasCleared =        CO_errorReset(EM, ERROR_CAN_TX_BUS_PASSIVE, err);
         if(wasCleared == 1) CO_errorReset(EM, ERROR_CAN_TX_OVERFLOW, err);
      }


      //CAN TX or RX bus warning
      if(err & 0x01){
         CO_errorReport(EM, ERROR_CAN_BUS_WARNING, err);
      }
      else{
         CO_errorReset(EM, ERROR_CAN_BUS_WARNING, err);
      }
   }
}

/******************************************************************************/
int CO_CANrecFromModule(CO_CANmodule_t *CANmodule, uint8_t FIFONumber, CO_CANrxMsg_t* RxMessage) {
    if( (CANmodule->CANbaseAddress->RF0R & CAN_RF0R_FMP0) > 0) {  // opravdu jsme neco prijali
        RxMessage->IDE = (uint8_t) 0x04 & CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RIR;
        if (RxMessage->IDE == CAN_Id_Standard) {
            RxMessage->ident = (uint32_t) 0x000007FF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RIR >> 21);
        } else {
            RxMessage->ExtId = (uint32_t) 0x1FFFFFFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RIR >> 3);
        }

        RxMessage->RTR = (uint8_t) 0x02 & CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RIR;
        /* Get the DLC */
        RxMessage->DLC = (uint8_t) 0x0F & CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDTR;
        /* Get the FMI */
        RxMessage->FMI = (uint8_t) 0xFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDTR >> 8);
        /* Get the data field */
        RxMessage->data[0] = (uint8_t) 0xFF & CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDLR;
        RxMessage->data[1] = (uint8_t) 0xFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDLR >> 8);
        RxMessage->data[2] = (uint8_t) 0xFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDLR >> 16);
        RxMessage->data[3] = (uint8_t) 0xFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDLR >> 24);
        RxMessage->data[4] = (uint8_t) 0xFF & CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDHR;
        RxMessage->data[5] = (uint8_t) 0xFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDHR >> 8);
        RxMessage->data[6] = (uint8_t) 0xFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDHR >> 16);
        RxMessage->data[7] = (uint8_t) 0xFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RDHR >> 24);
        /* Release the FIFO */
        /* Release FIFO0 */
        if (FIFONumber == CAN_FIFO0) {
            CANmodule->CANbaseAddress->RF0R |= CAN_RF0R_RFOM0;
        }/* Release FIFO1 */
        else /* FIFONumber == CAN_FIFO1 */ {
            CANmodule->CANbaseAddress->RF1R |= CAN_RF1R_RFOM1;
        }
        return 0;
    }
    return -1;
}

/******************************************************************************/
// Interrupt from Receiver
void CO_CANinterrupt_Rx(CO_CANmodule_t *CANmodule) {
    // Preruseni od prijmu  
    CO_CANrxMsg_t rcvMsg;
    if (CO_CANrecFromModule(CANmodule, CAN_FIFO0, &rcvMsg) == 0) {
        //CAN module filters are not used, message with any standard 11-bit identifier
        //has been received. Search rxArray form CANmodule for the same CAN-ID.
        UNSIGNED16 index;
        UNSIGNED8 msgMatched = 0;
        CO_CANrxArray_t *msgBuff = CANmodule->rxArray;
        for (index = 0; index < CANmodule->rxSize; index++) {
            UNSIGNED16 msg = (rcvMsg.ident << 2) | (rcvMsg.RTR ? 2 : 0); 
            if (((msg ^ msgBuff->ident) & msgBuff->mask) == 0) {
                msgMatched = 1;
                break;
            }
            msgBuff++;
        }
        //Call specific function, which will process the message
        if (msgMatched && msgBuff->pFunct)
            msgBuff->pFunct(msgBuff->object, &rcvMsg);
    }
}

/******************************************************************************/
// Interrupt from Transeiver
void CO_CANinterrupt_Tx(CO_CANmodule_t *CANmodule) {
    //First CAN message (bootup) was sent successfully
	CAN_ITConfig(CANmodule->CANbaseAddress, CAN_IT_TME, DISABLE); // Transmit mailbox empty interrupt

    CANmodule->firstCANtxMessage = 0;
    //Are there any new messages waiting to be send and buffer is free
    if (CANmodule->CANtxCount > 0) {
        UNSIGNED16 index; //index of transmitting message
        //search through whole array of pointers to transmit message buffers.
        for (index = 0; index < CANmodule->txSize; index++) {
            //get specific buffer
            CO_CANtxArray_t *buffer = &CANmodule->txArray[index];
            //if message buffer is full, send it.
            if (buffer->bufferFull) {
                // dokud je volny nejaky tx buffer
                INTEGER8 txBuff = getFreeTxBuff(CANmodule);
                if (txBuff == -1) {
                	// neni vse odvysilano a neni volny vysilac
                	CAN_ITConfig(CANmodule->CANbaseAddress, CAN_IT_TME, ENABLE); // Transmit mailbox empty interrupt
                	break;
                }
                //messages with syncFlag set (synchronous PDOs) must be transmited inside preset time window
                CANmodule->bufferInhibitFlag = 0;
                if (CANmodule->curentSyncTimeIsInsideWindow && buffer->syncFlag) {
                    if (!(*CANmodule->curentSyncTimeIsInsideWindow)) {
                        CO_errorReport((CO_emergencyReport_t*) CANmodule->EM, ERROR_TPDO_OUTSIDE_WINDOW, 0);
                        //release buffer
                        buffer->bufferFull = 0;
                        CANmodule->CANtxCount--;
                        continue; // continue with next message
                    }
                    CANmodule->bufferInhibitFlag = 1;
                }
                //Copy message to CAN buffer
                CO_CANsendToModule(CANmodule, buffer, txBuff);
                //release buffer
                buffer->bufferFull = 0;
                CANmodule->CANtxCount--;
            }
        }//end of for loop
    }
}

/******************************************************************************/
void CO_CANinterrupt_Status(CO_CANmodule_t *CANmodule) {
  // status is evalved with pooling
}

/******************************************************************************/
void CO_CANsendToModule(CO_CANmodule_t *CANmodule, CO_CANtxArray_t *buffer, UNSIGNED8 transmit_mailbox) {
    if ((transmit_mailbox >= 0) & (transmit_mailbox <= 3)) {
        /* Set up the Id */
        CANmodule->CANbaseAddress->sTxMailBox[transmit_mailbox].TIR &= TMIDxR_TXRQ;
        // RTR is included in ident
        CANmodule->CANbaseAddress->sTxMailBox[transmit_mailbox].TIR |= buffer->ident;
        /* Set up the DLC */
        buffer->DLC &= (uint8_t) 0x0000000F;
        CANmodule->CANbaseAddress->sTxMailBox[transmit_mailbox].TDTR &= (uint32_t) 0xFFFFFFF0;
        CANmodule->CANbaseAddress->sTxMailBox[transmit_mailbox].TDTR |= buffer->DLC;

        /* Set up the data field */
        CANmodule->CANbaseAddress->sTxMailBox[transmit_mailbox].TDLR = (((uint32_t) buffer->data[3] << 24) |
                ((uint32_t) buffer->data[2] << 16) |
                ((uint32_t) buffer->data[1] << 8) |
                ((uint32_t) buffer->data[0]));
        CANmodule->CANbaseAddress->sTxMailBox[transmit_mailbox].TDHR = (((uint32_t) buffer->data[7] << 24) |
                ((uint32_t) buffer->data[6] << 16) |
                ((uint32_t) buffer->data[5] << 8) |
                ((uint32_t) buffer->data[4]));

        // Transmit mailbox empty interrupt
        CAN_ITConfig(CANmodule->CANbaseAddress, CAN_IT_TME, ENABLE);
        /* Request transmission */
        CANmodule->CANbaseAddress->sTxMailBox[transmit_mailbox].TIR |= TMIDxR_TXRQ;
    }
}
